Reports/бит_ДвиженияДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>бит_ДвиженияДокумента</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_ЧекККМ</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_СправкиПаспортногоСтола</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_ПолучениеФакта</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_УстановкаЦенРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_ЕдиныйЖилДокумент</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_ВводНачальныхОстатковПоКУ</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_НачисленияПоСчетчикам</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_СобраниеТСЖ</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_ФормированиеПаспортаДома</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_РазовыеПоУслугамЖКХ</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_СвидетельствоОРегистрацииПоМестуПребывания</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_НачислениеЛьготПоЛицевымСчетам</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_ЗаявлениеТСЖ</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_бу_ОплатаБиллинговыхУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_НачислениеПоЛицевымСчетам</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_Предупреждение</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_ЗакрытиеСчетов</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_НачислениеПениПоЛицевымСчетам</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_РасчетПредельногоИндекса</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_ЗаявлениеОРегистрацииПоМестуПЖ</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_бу_РаспределениеОплатыПоПоставщикам</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_ОплатаКУ</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_бу_УстановкаБиллинговыхУслугНаЛС</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_ВводСуммПоРаспределениям</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_ВводНачальныхОстатковПениПоКУ</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_СправкаОСоставеСемьи</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_УстановкаИзменениеУслугПоЛС</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_СметаДоходовИРасходов</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_ЗаявкаНаВыполнениеРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_бу_НачисленияПоБиллинговымУслугам</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_УстановкаРаспределения</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_ИзменениеДатыПоверки</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_РасчетПредельногоИндексаОбщедомовыхЗатрат</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_УстановкаСоставаРаботы</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_ПодключениеУслугКЗданиям</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_ВводПоказанийПоСчетчикам</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_РегистрацияЛьготПоЛС</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_КорректировкаПоказанийСчетчиков</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_СвидетельствоОРегистрацииПоМестуПроживания</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_РегистрацияПроживающихПоЛС</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_УстановкаСтавокПоУслугам</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_бу_РазовыеПоБиллинговымУслугам</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_РаспределениеОплатыПоПоставщикам</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_УстановкаСоответствияЛьготыИУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_УстановкаСчетчика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВВидеТаблицы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/бит_ДвиженияДокумента/Forms/ФормаОтчетаУправляемая/Ext/Form/Module.bsl
#Область ПроцедурыИФункцииДляУправленияВнешнимВидомФорм

// Процедура осуществляет управление доступностью/видимостью элементов формы.
//
&НаКлиенте
Процедура УправлениеЭлементамиФормы()
	
	Элементы.Документ.Видимость = ПоказыватьДокумент;
	
КонецПроцедуры // УправлениеЭлементамиФормы()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

// Процедура - обработчик события "ПриОткрытии" формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// стандартные действия при создании на сервере
	бит_РаботаСДиалогамиСервер.ФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтаФорма, Отчет);

	МетаданныеОбъекта = Метаданные.Отчеты.бит_ДвиженияДокумента;
		
	Параметры.Свойство("Документ", Отчет.Документ);
	
    ПоказыватьДокумент = ?(Параметры.Свойство("ПоказыватьДокумент"), Параметры.ПоказыватьДокумент, Истина);
	
КонецПроцедуры

// Процедура - обработчик события "ПриОткрытии" формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если фОтказ Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// По умолчанию выводим в виде таблицы.
	ВыводДетализации 		   = "Вертикали";
	Отчет.ВыводитьВВидеТаблицы = Ложь;
	
	Если Не ОтчетСформирован Тогда

		СформироватьИВывестиОтчет();
		ОтчетСформирован = Истина;

	КонецЕсли;
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

// Процедура - обработчик события "ПриИзменении" поля выбора "ВыводДетализации".
//
&НаКлиенте
Процедура ВыводДетализацииПриИзменении(Элемент)
	
	Если ВыводДетализации = "Вертикали" Тогда
		Отчет.ВыводитьВВидеТаблицы = Ложь;
	Иначе
		Отчет.ВыводитьВВидеТаблицы = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

// Процедура - обработчик команды "Сформировать" формы.
//
&НаКлиенте
Процедура СформироватьВыполнить(Команда)
	
	Если НЕ ЗначениеЗаполнено(Отчет.Документ) Тогда
		
		ПоказатьПредупреждение(Новый ОписаниеОповещения("СформироватьВыполнитьЗавершение", ЭтотОбъект), "Выберите документ, движения которого Вы хотите увидеть");
		
		Возврат;
	КонецЕсли;
	
	СформироватьИВывестиОтчет();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьВыполнитьЗавершение(ДополнительныеПараметры) Экспорт
    
	Завершение = Истина;  

КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Процедура вызывает процедуру объекта отчета по формированию.
//
&НаСервере
Процедура СформироватьИВывестиОтчет()
	
	РеквизитФормыВЗначение("Отчет").СформироватьОтчет(ТабличныйДокумент);
	
КонецПроцедуры

#КонецОбласти
